# Grid2Justification Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGrid..::..Grid2Justification Property
CurtainGrid Class See Also
---
The justification for the V grid line pattern of the curtain grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurtainGridAlignType Grid2Justification { get; set; }
```

Visual Basic
---
```text
Public Property Grid2Justification As CurtainGridAlignType
	Get
	Set
```

Visual C++
---
```text
public:
property CurtainGridAlignType Grid2Justification {
	CurtainGridAlignType get ();
	void set (CurtainGridAlignType value);
}
```

# See Also
CurtainGrid Class
Autodesk.Revit.DB Namespace